In [1]:
import pandas as pd
import sqlite3
tmpdb = sqlite3.connect('tmp2.db')
%load_ext sql
%sql sqlite:///tmp2.db
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [2]:
%%sql 

CREATE TABLE IF NOT EXISTS STUDENT (
  ROLL_NO TEXT PRIMARY KEY,
  NAME TEXT NOT NULL,
  ADDRESS TEXT,
  PHONE TEXT,
  AGE INTEGER
);

INSERT INTO STUDENT (ROLL_NO, NAME, ADDRESS, PHONE, AGE) VALUES
  ('1', 'RAM', 'DELHI', '*****', 18),
  ('2', 'RAMESH', 'GURGAON', '*****', 18),
  ('3', 'SUJIT', 'ROHTAK', '*****', 20),
  ('4', 'SURESH', 'DELHI', '*****', 18),
  ('5', 'AMAN', 'ROHTAK', '*****', 20),
  ('6', 'HARSH', 'GURGAON', '*****', 18);

 * sqlite:///tmp2.db
Done.
6 rows affected.

[]

In [3]:
%%sql 

SELECT * FROM STUDENT

 * sqlite:///tmp2.db
Done.

[('1', 'RAM', 'DELHI', '*****', 18),
 ('2', 'RAMESH', 'GURGAON', '*****', 18),
 ('3', 'SUJIT', 'ROHTAK', '*****', 20),
 ('4', 'SURESH', 'DELHI', '*****', 18),
 ('5', 'AMAN', 'ROHTAK', '*****', 20),
 ('6', 'HARSH', 'GURGAON', '*****', 18)]

In [4]:
%%sql

SELECT * FROM STUDENT WHERE AGE = 18 AND ADDRESS = 'DELHI';

 * sqlite:///tmp2.db
Done.

[('1', 'RAM', 'DELHI', '*****', 18), ('4', 'SURESH', 'DELHI', '*****', 18)]

In [5]:
%%sql 

SELECT * FROM STUDENT WHERE AGE = 18 AND NAME = 'RAM';

 * sqlite:///tmp2.db
Done.

[('1', 'RAM', 'DELHI', '*****', 18)]

In [6]:
%%sql 

SELECT * FROM STUDENT WHERE NAME = 'RAM' OR NAME = 'SUJIT';

 * sqlite:///tmp2.db
Done.

[('1', 'RAM', 'DELHI', '*****', 18), ('3', 'SUJIT', 'ROHTAK', '*****', 20)]

In [7]:
%%sql

SELECT * FROM STUDENT WHERE NAME = 'RAM' OR AGE = 20;

 * sqlite:///tmp2.db
Done.

[('1', 'RAM', 'DELHI', '*****', 18),
 ('3', 'SUJIT', 'ROHTAK', '*****', 20),
 ('5', 'AMAN', 'ROHTAK', '*****', 20)]

In [8]:
%%sql

SELECT * FROM STUDENT WHERE AGE = 18 AND (NAME = 'RAM' OR NAME = 'RAMESH');

 * sqlite:///tmp2.db
Done.

[('1', 'RAM', 'DELHI', '*****', 18), ('2', 'RAMESH', 'GURGAON', '*****', 18)]

In [9]:
%%sql

CREATE TABLE IF NOT EXISTS PRODUCT(
  PRO_ID TEXT PRIMARY KEY,
  PRO_NAME TEXT,
  PRO_PRICE numeric(9,2),
  PRO_COM TEXT
);

 * sqlite:///tmp2.db
Done.

[]

In [10]:
%%sql

INSERT INTO PRODUCT(PRO_ID,PRO_NAME,PRO_PRICE,PRO_COM)
VALUES
  ("101","MOTHER BOARD",3200.00,"15"),
  ("102","KEY BOARD",450.00,"16"),
  ("103","ZIP DRIVE",250.00,"14"),
  ("104","SPEAKER",550.00,"16"),
  ("105","MONITOR",5000.00,"11"),
  ("106","DVD DRIVE",900.00,"12"),
  ("107","CD DRIVE",800.00,"12"),
  ("108","PRINTER",2600.00,"13"),
  ("109","REFILL CARTRIDGE",350.00,"13"),
  ("110","MOUSE",250.00,"12");

 * sqlite:///tmp2.db
10 rows affected.

[]

In [11]:
%%sql

SELECT * FROM PRODUCT

 * sqlite:///tmp2.db
Done.

[('101', 'MOTHER BOARD', 3200, '15'),
 ('102', 'KEY BOARD', 450, '16'),
 ('103', 'ZIP DRIVE', 250, '14'),
 ('104', 'SPEAKER', 550, '16'),
 ('105', 'MONITOR', 5000, '11'),
 ('106', 'DVD DRIVE', 900, '12'),
 ('107', 'CD DRIVE', 800, '12'),
 ('108', 'PRINTER', 2600, '13'),
 ('109', 'REFILL CARTRIDGE', 350, '13'),
 ('110', 'MOUSE', 250, '12')]

In [12]:
%%sql

SELECT pro_name, pro_price
FROM PRODUCT
WHERE pro_price = (SELECT MIN(pro_price) FROM PRODUCT);

 * sqlite:///tmp2.db
Done.

[('ZIP DRIVE', 250), ('MOUSE', 250)]

In [13]:
%%sql

SELECT pro_name, pro_price
FROM PRODUCT
WHERE pro_price = (SELECT MAX(pro_price) FROM PRODUCT);

 * sqlite:///tmp2.db
Done.

[('MONITOR', 5000)]

In [14]:
%%sql 
SELECT MAX(pro_price) FROM PRODUCT

 * sqlite:///tmp2.db
Done.

[(5000,)]